alfred
anaconda
android-file-transfer
android-platform-tool
asciinema
atom
betterzip
brave-browser
browserosaurus
chromium
dash
discord
djview
docker
electrum
fbreader
figma
firefox
firefox-developer-edition
flash-player
font-fira-code
font-hack-nerd-font
gimp
google-chrome
grammarly
insomnia
iterm2
java
keycastr
lens
libreoffice
mactex
mendeley-desktop
mqttfx
neovim
opera
# Mount drive through SFTP
osxfuse
qlcolorcode
qlimagesize
qlmarkdown
qlstephen
qlvideo
quicklook-json
quicklookase
quik
skype
speedtest-cli
steam
teamviewer
tor-browser
tunnelblick
virtualbox
virtualbox-extension-pack
vlc
webpquicklook
wireshark
wkhtmltopdf
zeplin
