anaconda
android-file-transfer
android-platform-tool
app-cleaner
asciinema
atom
betterzip
chromium
discord
docker
electrum
fbreader
figma
firefox
flash-player
grammarly
insomnia
iterm2
java
keepassx
kitematic
mactex
mendeley-desktop
mqttfx
opera
qlcolorcode
qlimagesize
qlmarkdown
qlstephen
qlvideo
quicklook-json
quicklookase
skype
speedtest-cli
steam
teamviewer
tor-browser
tunnelblick
virtualbox
virtualbox-extension-pack
vlc
webpquicklook
wireshark
wkhtmltopdf
zeplin
