# Some instructions of how to interact with the Brewfile
# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f
# 
# A big list of comonly used brew packages
# https://github.com/joelparkerhenderson/brewfile/blob/master/Brewfile

# Migrate it all on Nix and leave here anly what cannot be installed through Nix

tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "heroku/brew"
# Rust implementation of `age`
tap "str4d.xyz/rage", "https://str4d.xyz/rage"

brew "antigen"
brew "awscli"
brew "axel"
brew "bash"
brew "bat"
brew "bitwarden-cli"
brew "cheat"
brew "checkbashisms"
brew "circleci"
brew "clang-format"
brew "coreutils"
brew "direnv"
brew "eksctl"
brew "ffmpeg"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "gotop"
brew "gpg"
brew "grc"
brew "heroku"
# Is required to fix the ranger's freezes
# https://github.com/ranger/ranger/issues/1787#issuecomment-691528698https://github.com/ranger/ranger/issues/1787#issuecomment-691528698
brew "highlight"
brew "htop"
brew "imagemagick"
# ftp, telnet, etc.
brew "inetutils"
brew "jq"
brew "jupyterlab"
brew "lazygit"
# PostgreSQl
brew "libpq"
brew "logrotate"
brew "lsyncd"
brew "lua"
brew "luajit-openresty"
brew "make"
brew "mas"
brew "midnight-commander"
brew "mobile-shell"
brew "mpv"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "onefetch"
brew "openjdk"
# Mainly for PostgreSQl 
brew "openssl"
brew "openvpn"
brew "perl"
brew "php"
brew "pinentry"
brew "pipenv"
brew "postgresql"
brew "pyenv"
brew "qemu"
brew "rage"
brew "ranger"
brew "readline"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "sox"
brew "speedtest-cli"
# As education have finished
# brew "spin"
brew "stow"
brew "svgo"
brew "testdisk"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "tree"
brew "wget"
brew "ykman"
brew "yq"
brew "zsh"
brew "zsh-history-substring-search"
brew "eth-p/software/bat-extras"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-djvu"
brew "zegervdv/zathura/zathura-pdf-poppler"

cask "1password"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "amethyst"
# As no Android devices at the moment
# cask "android-file-transfer"
# cask "android-platform-tools"
cask "appcleaner"
cask "authy"
cask "betterzip"
cask "brave-browser"
cask "browserosaurus"
cask "browserstacklocal"
cask "chromium"
cask "cloudflare-warp"
# Includes "meetingbar" analogue
cask "cron"
cask "crossover"
cask "cryptomator"
cask "dash"
cask "deluge"
cask "devtoys"
cask "discord"
cask "dotnet-sdk"
cask "djview"
cask "docker"
cask "duplicati"
cask "electrum"
cask "element"
cask "exodus"
cask "fbreader"
cask "figma"
cask "firefox"
cask "flash-npapi"

# Nerd fonts for the powerlevel10k and vim-airline
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"

cask "gimp"
cask "gog-galaxy"
cask "google-chrome"
cask "google-drive"
cask "gnucash"
cask "grammarly"
cask "hazeover"
cask "hiddenbar"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "insomnia"
cask "joplin"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "ksdiff"
cask "launchcontrol"
cask "libreoffice"
cask "macfuse"
cask "mendeley"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mqttfx"
cask "ngrok"
cask "notion"
cask "numi"
cask "obs"
cask "obsidian"
cask "opera"
cask "openemu"
cask "origin"
cask "playonmac"
cask "porting-kit"
cask "postman"
cask "prismatik"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "quik"
cask "raycast"
cask "raspberry-pi-imager"
cask "rocket"
cask "shottr"
cask "skype"
cask "slack"
cask "steam"
cask "teamviewer"
cask "tor-browser"
cask "tunnelblick"
cask "visual-studio-code"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vk-messenger"
cask "vlc"
cask "webpquicklook"
cask "whatsapp"
cask "wireshark"
cask "wkhtmltopdf"
cask "yandex"
cask "yandex-disk"
cask "yubico-yubikey-manager"
cask "yubico-yubikey-personalization-gui"
cask "yubico-yubikey-piv-manager"
cask "zeplin"

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Dropover", id: 1355679052
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Notchmeister", id: 1599169747
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Spark", id: 1176895641
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
