# Some instructions of how to interact with the Brewfile
# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f
# 
# A big list of comonly used brew packages
# https://github.com/joelparkerhenderson/brewfile/blob/master/Brewfile

# Migrate it all on Nix and leave here anly what cannot be installed through Nix

tap "eth-p/software"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "zegervdv/zathura"

brew "antigen"
brew "awscli"
brew "axel"
brew "bash"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "checkbashisms"
brew "circleci"
brew "composer"
brew "coreutils"
brew "direnv"
brew "docker", link: false
brew "eksctl"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fnm"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-gui"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "goto"
brew "gotop"
brew "gpg"
brew "grc"
brew "gron"
# Is required to fix the ranger's freezes
# https://github.com/ranger/ranger/issues/1787#issuecomment-691528698https://github.com/ranger/ranger/issues/1787#issuecomment-691528698
brew "highlight"
brew "htop"
brew "libomp"
brew "imagemagick"
brew "inetutils"
brew "jq"
brew "jupyterlab"
brew "logrotate"
brew "lsyncd"
brew "make"
brew "mas"
brew "midnight-commander"
brew "minikube"
brew "mobile-shell"
brew "mpv"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "openblas"
brew "openjdk"
brew "openvpn"
brew "perl"
brew "php"
brew "pipenv"
brew "postgresql"
brew "pyenv"
brew "qemu"
brew "ranger"
brew "readline"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rustup-init"
brew "sox"
brew "speedtest-cli"
brew "spin"
brew "stow"
brew "svgo"
brew "testdisk"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "tree"
brew "wget"
brew "ykman"
brew "yq"
brew "zsh"
brew "zsh-history-substring-search"
brew "eth-p/software/bat-extras"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-djvu"
brew "zegervdv/zathura/zathura-pdf-poppler"

cask "adobe-acrobat-reader"
cask "alacritty"
cask "amethyst"
cask "anaconda"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "atom"
cask "authy"
cask "betterzip"
cask "brave-browser"
cask "browserosaurus"
cask "browserstacklocal"
cask "chromium"
cask "dash"
cask "deluge"
cask "discord"
cask "djview"
cask "docker"
cask "electrum"
cask "fbreader"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "flash-player"
cask "font-fira-code"
cask "font-fontawesome"
cask "font-iosevka-ss05"
cask "font-hack-nerd-font"
cask "gimp"
cask "gnucash"
cask "grammarly"
cask "hazeover"
cask "hiddenbar"
cask "insomnia"
cask "java"
cask "keybase"
cask "keycastr"
cask "kitty"
cask "ksdiff"
cask "lens"
cask "libreoffice"
cask "mactex"
cask "meetingbar"
cask "mendeley"
cask "mendeley-desktop"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mqttfx"
cask "ngrok"
cask "obs"
cask "opera"
cask "osxfuse"
cask "porting-kit"
cask "postman"
cask "prismatik"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "quik"
cask "raycast"
cask "rocket"
cask "shottr"
cask "skype"
cask "slack"
cask "soulver"
cask "steam"
cask "teamviewer"
cask "tor-browser"
cask "tunnelblick"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vivaldi"
cask "vk-messenger"
cask "vlc"
cask "webpquicklook"
cask "whatsapp"
cask "wireshark"
cask "wkhtmltopdf"
cask "xquartz"
cask "yubico-yubikey-manager"
cask "yubico-yubikey-personalization-gui"
cask "yubico-yubikey-piv-manager"
cask "zeplin"

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Dropover", id: 1355679052
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
